OdGUID.op_Assign(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Assignment operator.
\param other [in] String representation of GUID to be assigned.

OdGUID.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator.
\param other [in] String representation of GUID to be assigned.

OdGUID.op_Assign(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator.
\param other [in] String representation of GUID to be assigned.

OdGUID.#ctor(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new instance of a OdGUID object with copied data from string representation of GUID.
\param value [in] GUID string  to copy from.

OdGUID.#ctor(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new instance of a OdGUID object with copied data from string representation of GUID.
\param value [in] GUID string  to copy from.

OdGUID.#ctor(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new instance of a OdGUID object with copied data from string representation of GUID.
\param value [in] GUID string  to copy from.

OdGUID.#ctor(System.Byte!System.Runtime.CompilerServices.IsConst(*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)[N16])
\details
Creates a new instance of a OdGUID object with copied data from other data.
\param data [in] GUID data to copy from.